init.org
#+TITLE: Config of Emacs
#+DESCRIPTION: This is the org mode version of my config of emacs
#+FILETAGS: Config
#+PROPERTY: header-args :tangle ~/.config/emacs/init.el :lexical t

* Table of Content :toc:noexport:
- [[#early-initel][Early-init.el]]
- [[#customized-default][Customized Default]]
- [[#custom-function][Custom Function]]
- [[#package-initialize][Package initialize]]
  - [[#elpaca][Elpaca]]
  - [[#straight][Straight]]
- [[#packages][Packages]]
  - [[#keybindings][Keybindings]]
  - [[#generally-helpful-package][Generally helpful Package]]
  - [[#ui][UI]]
  - [[#coding][Coding]]
  - [[#completion][Completion]]
  - [[#org][Org]]
- [[#package-install-wait][Package install wait]]
- [[#keybindings-1][Keybindings]]
  - [[#leader-key-definer-definations][Leader key definer definations]]
  - [[#general-good-defaults][General good defaults]]
  - [[#custom-function-map][Custom Function Map]]
  - [[#org-agenda][Org agenda]]
  - [[#dashboard-map][Dashboard Map]]
  - [[#magit-map][Magit Map]]
  - [[#denote-map][Denote Map]]
  - [[#project][Project]]
  - [[#consult-map][Consult Map]]
  - [[#hop-map][Hop Map]]
  - [[#buffer-map][Buffer Map]]
  - [[#org-map][Org Map]]
  - [[#fold][Fold]]
  - [[#helpful][Helpful]]
  - [[#tempel][Tempel]]
  - [[#eglot][Eglot]]

* Early-init.el
Stopping Some modules which i don't use from being loaded like menu-bar-mode,tool-bar-mode,scroll-bar-mode and package.el (build in emacs package manager).
#+begin_src emacs-lisp :tangle ./early-init.el
;;; early-init.el --- Emacs early init -*- lexical-binding: t; -*-

;;; Commentary:

;; Emacs 27 introduced early-init.el, which is run before init.el, before
;; package and UI initialization happens.

;;; Code:
;; (setq init-file-debug t)
;; (setq messages-buffer-max-lines 100000)

;; If an `.el' file is newer than its corresponding `.elc', load the `.el'.
(setq load-prefer-newer t)

;; Set Garbage Collection threshold to 1GB during startup. `gcmh' will clean
;; things up later.
(setq gc-cons-threshold 1073741824
      gc-cons-percentage 0.6)

;; Write any customizations to a temp file so they are discarded.
(setq custom-file (make-temp-file "custom-" nil ".el"))

;; Faster to disable these here (before they've been initialized)
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq scroll-conservatively 200
      scroll-margin 3)

;; Give the frame basic coloring while waiting for the theme to load. The main
;; purpose of this is to not blind me when it's dark by flashing a screen full
;; of white. These colors are from doom-one.
;; (set-face-attribute 'default nil :background "#282c34" :foreground "#bbc2cf")
;; Default frame settings. This is actually maximized, not full screen.
(push '(fullscreen . maximized) initial-frame-alist)
(push '(ns-transparent-titlebar . t) default-frame-alist)

;; Resizing the Emacs frame can be a terribly expensive part of changing the
;; font. By inhibiting this, we easily halve startup times with fonts that are
;; larger than the system default.
(setq frame-inhibit-implied-resize t
      frame-resize-pixelwise t)

(setq package-enable-at-startup nil)

(setq native-comp-async-report-warnings-errors nil)

(setq use-dialog-box t ; only for mouse events, which I seldom use
      use-file-dialog nil
      inhibit-splash-screen t
      inhibit-startup-screen t
      inhibit-startup-echo-area-message user-login-name ; read the docstring
      inhibit-startup-buffer-menu t)

;; Debugging
(setq debug-on-error t)

;; Reduce startup time due to file-handler matching
(defvar default-file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)

;; Set a few post-run handlers
(defun +gc-after-focus-change ()
  "Run GC when frame loses focus."
  (run-with-idle-timer
   5 nil
   (lambda () (unless (frame-focus-state) (garbage-collect)))))

(defun +reset-init-values ()
  (run-with-idle-timer
   1 nil
   (lambda ()
     (setq file-name-handler-alist default-file-name-handler-alist
           gc-cons-percentage 0.1
           gc-cons-threshold (* 100 1024 1024))
     (message "Set gc-cons-threshold = 100M & file-name-handler-alist restored")
     (when (boundp 'after-focus-change-function)
       (add-function :after after-focus-change-function #'+gc-after-focus-change)))))

(with-eval-after-load 'elpaca
  (add-hook 'elpaca-after-init-hook '+reset-init-values))

(provide 'early-init)
;;; early-init.el ends here
#+end_src
* Customized Default
Setting some default which suit well for me as well as enabling some performance optimizations
#+begin_src emacs-lisp
;;; init.el -*- lexical-binding: t; -*-
(defvar native-comp-deferred-compilation-deny-list nil)      ;;Native comp variable change in emacs 30
(setq create-lockfiles nil                                   ;;Don't want #..# files everywhere
      make-backup-files nil)                                 ;;Don't want Redundant copy of files
(setq recentf-max-menu-items 25)                             ;;Recent files opened list size
(setq revert-without-query '(".*"))                          ;;Keeps the file in sync with what is on the disk without a prompt to confirm
(recentf-mode 1)                                             ;;You can disable recent files here (just set 1 to -1)
(save-place-mode 1)                                          ;;When you open a file the cursor will be in the same position at which you closed the file
(setq read-process-output-max (* 1024 1024))                 ;;Emacs can read output from programs faster ( makes lsp mode faster )
(set-default-coding-systems 'utf-8)                          ;;Don't want to have encoding errors
(setq inhibit-startup-screen t)                              ;;Don't want to see the emacs startup screen
(setq visible-bell t)                                        ;;Blinks the top bar and modeline to the color set in doom-themes-visual-bell
(setq-default tab-width 4)                                   ;;The tab width battle continues
(setq-default evil-shift-width tab-width)                    ;;We want the tab width to be same in the vim mode of emacs
(setq-default indent-tabs-mode nil)                          ;;Don't want formatters to insert <TAB> just use spaces

(setq use-short-answers t)                                   ;; In prompt answer instead of typing complete yes with this y will work as well

(global-display-line-numbers-mode t)                         ;;All people like line numbers right
(setq display-line-numbers-type 'relative)

(setq custom-file (locate-user-emacs-file "custom.el"))
(load custom-file 'noerror 'nomessage)

(setq electric-pair-preserve-balance t)
(setq dired-recursive-copies 'always
      dired-recursive-deletes 'always)

(setq delete-by-moving-to-trash t
      dired-listing-switches "-AGFhlv --group-directories-first --time-style=long-iso"
      dired-dwim-target t
      dired-auto-revert-buffer #'dired-directory-changed-p
      dired-make-directory-clickable nil
      dired-free-space nil)

(setq resize-mini-windows t)

(add-hook 'dired-mode-hook #'hl-line-mode)
(setq dired-isearch-filenames 'dwim
      dired-create-destination-dirs 'ask
      dired-vc-rename-file t
      dired-do-revert-buffer (lambda (dir  (not (file-remote-p dir ))) )
      dired-clean-up-buffers-too t
      dired-clean-confirm-killing-deleted-buffers t
      dired-x-hands-off-my-keys t     ; easier to show the keys I use
      dired-bind-man nil
      dired-bind-info nil
      delete-by-moving-to-trash t
      +vertico-consult-fd-args "fd -p --color=never -i --type f -E node_modules --regex")

(put 'narrow-to-region 'disabled nil)

(electric-pair-mode 1)
(set-fringe-mode 10)
(setq auto-save-default t
      truncate-string-ellipsis "<>"
      which-key-idle-delay 0.5)
(setq x-stretch-cursor t
      window-combination-resize t
      global-auto-revert-mode 1
      global-auto-revert-non-file-buffers t)
(setq backup-directory-alist `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms `((".*" ,temporary-file-directory t)))
#+end_src
* Custom Function
*** Org autoload
#+begin_src emacs-lisp
(autoload #'+org/dwim-at-point (concat user-emacs-directory "autoload/+org"))
#+end_src
*** Trailing whitespace
#+begin_src emacs-lisp
;; (setq-default show-trailing-whitespace t)
;; (add-hook 'prog-mode-hook
;;           (lambda () (font-lock-add-keywords nil '(("\\s-+$" 0 'trailing-whitespace)))))
#+end_src
*** Backspace
#+begin_src emacs-lisp
(defun my/backward-kill-word ()
  "Kill backward to the beginning of the current word, but do not cross lines."
  (interactive)
  (if (not (looking-back "^\\s-*")) (backward-kill-word 1) (delete-horizontal-space)))
#+end_src
*** File operations
[[https://github.com/doomemacs/doomemacs/blob/5c563d307b7fe0cc65e8d5c235565e96ccca3b35/lisp/lib/files.el#L464][Source: doomemacs/files.el at 5c563d307b7fe0cc65e8d5c235565e96ccca3b35 · doomemacs/do...]]
#+begin_src emacs-lisp
(defun adi--sudo-file-path (file)
  (let ((host (or (file-remote-p file 'host) "localhost")))
    (concat "/" (when (file-remote-p file)
                  (concat (file-remote-p file 'method) ":"
                          (if-let (user (file-remote-p file 'user))
                              (concat user "@" host)
                            host)
                          "|"))
            "sudo:root@" host
            ":" (or (file-remote-p file 'localname)
                    file))))

(defun adi/sudo-find-file (file)
  "Open FILE as root."
  (interactive "FOpen file as root: ")
  (find-file (adi--sudo-file-path file)))

(defun adi/sudo-this-file ()
  "Open the current file as root."
  (interactive)
  (find-file
   (adi--sudo-file-path
    (or buffer-file-name
        (when (or (derived-mode-p 'dired-mode)
                  (derived-mode-p 'wdired-mode))
          default-directory)))))

(defun adi/sudo-save-buffer ()
  "Save this file as root."
  (interactive)
  (let ((file (adi--sudo-file-path buffer-file-name)))
    (if-let (buffer (find-file-noselect file))
        (let ((origin (current-buffer)))
          (copy-to-buffer buffer (point-min) (point-max))
          (unwind-protect
              (with-current-buffer buffer
                (save-buffer))
            (unless (eq origin buffer)
              (kill-buffer buffer))
            (with-current-buffer origin
              (revert-buffer t t))))
      (user-error "Unable to open %S" file))))

#+end_src
*** Denote archive
#+begin_src emacs-lisp
(defun my-denote--add-todo-keyword ()
  "Add the todo keyword to the new captured note if it is under the Todo Sub directory"
  (let* ((file denote-last-path))
    (if (string= (file-name-directory file) (file-name-as-directory denote-todo-directory))
        (let* ((file-type (denote-filetype-heuristics file))
               (title (denote-retrieve-title-value file file-type))
               (keywords (denote-retrieve-keywords-value file file-type)))
          (denote-rename-file file title (append '("todo") keywords))))))

(defun my-denote--add-todo-or-archive-keyword (file file-type)
  "Replace todo with archive keyword (or vice versa) in FILE, given FILE-TYPE.
  See `my-denote-move-from-todo-to-archive'."
  (let* ((keywords (denote-retrieve-keywords-value file file-type)))
    (cond
     ((member "todo" keywords)
      (setq keywords (delete "todo" keywords)
            keywords (append '("archive") keywords)))
     ((member "archive" keywords)
      (setq keywords (delete "archive" keywords)
            keywords (append '("todo") keywords)))
     (t keywords))))

(defun my-denote-move-from-todo-to-archive ()
  (interactive)
  ;; Like the above example, but we pass values directly to
  ;; `denote-rename-file' instead of doing it interactively.  More
  ;; precisely, we re-use the existing title and keywords, while
  ;; adding "todo" to the list of keywords.
  (let* ((file (denote--rename-dired-file-or-prompt))
         (file-type (denote-filetype-heuristics file)))
    (denote-rename-file
     file
     (denote-retrieve-title-value file file-type)
     (my-denote--add-todo-or-archive-keyword file file-type)))
  (let* ((file (denote--rename-dired-file-or-prompt))
         (archive-target (string-replace "/Todo/" "/Archived/" file)))
    (rename-file file archive-target)
    (denote-update-dired-buffers)))
#+end_src
*** Random Element from the list
#+begin_src emacs-lisp
(defun random-element-of-list (items)
  ;; Selects a random element from a list
  (let* ((size (length items))
         (index (random size)))
    (nth index items)))
#+end_src
*** Competitive layout
With smart-compile this function is very useful to run multiple test cases with compilation.
#+begin_src emacs-lisp
(defun Competitive-coding-output-input-toggle ()
  ;; Open side buffer to show inputf.in and outputf.in files as input and output of code file with the `SPC m z` Keybinding in rust-mode
  (interactive)
  (delete-other-windows)
  (kill-matching-buffers "*.in")
  (evil-window-vsplit)
  (find-file (expand-file-name "inputf.in" default-directory))
  (evil-window-split)
  (find-file (expand-file-name "outputf.in" default-directory))
  (other-window 1)
  (enlarge-window-horizontally 40))
#+end_src
*** Rust reset
#+begin_src emacs-lisp
(defun rust-reset()
  ;;Delete the entire buffer and expand a default template defined in `./templates` with the `SPC m r` Keybinding in rust-mode
  (interactive)
  (widen)
  (erase-buffer)
  (tempel-insert 'chef)
  (narrow-to-defun))
#+end_src
*** Rust paste input
#+begin_src emacs-lisp
(defun code-input-refresh()
  ;; Places the clipboard content in the inputf.in file with the `SPC m i` Keybinding in rust-mode
  (interactive)
  (write-region (current-kill 0) nil (concat default-directory "inputf.in") nil)
  (Competitive-coding-output-input-toggle))
#+end_src
